{
  "architectures": [
    "LLaVAOneVision1_5_ForConditionalGeneration"
  ],
  "image_token_id": 151655,
  "auto_map": {
        "AutoConfig": "configuration_llavaonevision1_5.Llavaonevision1_5Config",
        "AutoModel": "modeling_llavaonevision1_5.LLaVAOneVision1_5_ForConditionalGeneration",
        "AutoModelForCausalLM": "modeling_llavaonevision1_5.LLaVAOneVision1_5_ForConditionalGeneration"
  },
  "text_config": {
    "attention_bias": false,
    "attention_dropout": 0.0,
    "head_dim": 128,
    "hidden_act": "silu",
    "hidden_size": 4096,
    "image_token_id": null,
    "initializer_range": 0.02,
    "intermediate_size": 12288,
    "tie_word_embeddings": false,
    "layer_types": [
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention"
    ],
    "max_position_embeddings": 32768,
    "max_window_layers": 36,
    "model_type": "LLaVAOneVision1_5_text",
    "num_attention_heads": 32,
    "num_hidden_layers": 36,
    "num_key_value_heads": 8,
    "rms_norm_eps": 1e-06,
    "rope_scaling": null,
    "rope_theta": 1000000.0,
    "sliding_window": null,
    "use_cache": true,
    "use_sliding_window": false,
    "video_token_id": null,
    "vocab_size": 151936
  },
  "torch_dtype": "bfloat16",
  "transformers_version": "4.53.0",
  "video_token_id": 151656,
  "vision_config": {
    "depth": 24,
    "embed_dim": 1024,
    "hidden_act": "gelu",
    "hidden_size": 1024,
    "in_channels": 3,
    "initializer_range": 0.02,
    "intermediate_size": 4096,
    "layer_norm_eps": 1e-05,
    "model_type": "rice_vit",
    "num_heads": 16,
    "patch_size": 14,
    "spatial_merge_size": 2,
    "temporal_patch_size": 1,
    "text_hidden_size": 4096
  },
  "vocab_size": 151936
}
